##### 평가 1.

In [4]:
import numpy as np
import pandas as pd

In [5]:
# 1.
df = pd.DataFrame(np.random.randint(10, 100, size=(5, 5)))
df

    0   1   2   3   4
0  17  45  88  61  70
1  34  46  21  91  78
2  39  18  56  47  39
3  27  40  12  96  40
4  91  14  82  57  31

In [6]:
# 2.
df.columns = list('VWXYZ')
df.index = list('abcde')
df

    V   W   X   Y   Z
a  17  45  88  61  70
b  34  46  21  91  78
c  39  18  56  47  39
d  27  40  12  96  40
e  91  14  82  57  31

In [8]:
# 3.
df['X']['c']

56

##### 평가 2.

In [9]:
# 1.
df = pd.read_csv('data/법정동코드 전체자료.txt', sep='\t', encoding='euc-kr')
df.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [10]:
# 2.
df = df[df.폐지여부 == '존재']
df = df[df.법정동명.str.contains('수원시')]
df.head()

           법정동코드             법정동명 폐지여부
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재

In [12]:
# 3.
df = df[df.법정동명.str.contains('장안구') & df.법정동명.str.contains('동')]
df.head()

           법정동코드             법정동명 폐지여부
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재
4916  4111113200  경기도 수원시 장안구 율전동   존재
4917  4111113300  경기도 수원시 장안구 천천동   존재

In [13]:
dong_list = []
for line in df.법정동명:
    dong = line.split()[-1].strip()
    dong_list.append(dong)
dong_list

['파장동', '정자동', '이목동', '율전동', '천천동', '영화동', '송죽동', '조원동', '연무동', '상광교동', '하광교동']

##### 평가 3.

In [15]:
# 1.
import seaborn as sns
dt = sns.load_dataset('titanic')
dt.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [16]:
dt.drop(columns=['deck'], inplace=True)     # 결측치가 너무 많아 열 삭제
dt.embarked.value_counts()

embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [17]:
dt.embarked.fillna('S', inplace=True)   # 결측치가 별로 없어서 최빈값으로 대체
dt.embark_town.value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [18]:
dt.embark_town.fillna('Southampton', inplace=True)  # 상동
dt.age.fillna(dt.age.median().round(1), inplace=True)       # 중앙값으로 대체
dt.isna().sum().sum()

0

In [19]:
# 2.
dt['cat'] = pd.qcut(dt.age, 3, labels=['A1', 'A2', 'A3'])
dt.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone,cat
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,Southampton,no,True,A2
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,Southampton,yes,True,A1
888,0,3,female,28.0,1,2,23.45,S,Third,woman,False,Southampton,no,False,A2
889,1,1,male,26.0,0,0,30.00,C,First,man,True,Cherbourg,yes,True,A2
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,Queenstown,no,True,A3

In [20]:
# 3. 성별과 embark_town에 따른 생존률
dt.pivot_table('survived', 'sex', 'embark_town')

embark_town  Cherbourg  Queenstown  Southampton
sex
female        0.876712    0.750000     0.692683
male          0.305263    0.073171     0.174603

In [22]:
# 4. 타이타닉 탑승객의 성별에 따른 평균 나이
dt.pivot_table('age', 'sex')

              age
sex
female  27.929936
male    30.140676